Masmiseim36/nxpSDK/boards/twrkv46f150m/bootloader_examples/demo_apps/led_demo_tower_a000/pin_mux.h
/*
 * Copyright 2020 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*! @name PORTD0 (number 93), J500[A40]/J501[9]/GPIOD0/PWM_A0/LED0
  @{ */
#define BOARD_LED_GREEEN1_GPIO GPIOD /*!<@brief GPIO device name: GPIOD */
#define BOARD_LED_GREEEN1_PORT PORTD /*!<@brief PORT device name: PORTD */
#define BOARD_LED_GREEEN1_PIN 0U     /*!<@brief PORTD pin index: 0 */
                                     /* @} */

/*! @name PORTD1 (number 94), J500[A39]/J501[11]/GPIOD1/PWM_B0/LED1
  @{ */
#define BOARD_LED_YELLOW1_GPIO GPIOD /*!<@brief GPIO device name: GPIOD */
#define BOARD_LED_YELLOW1_PORT PORTD /*!<@brief PORT device name: PORTD */
#define BOARD_LED_YELLOW1_PIN 1U     /*!<@brief PORTD pin index: 1 */
                                     /* @} */

/*! @name PORTD2 (number 95), J500[A38]/J501[30]/GPIOD2/PWM_A1/LED2
  @{ */
#define BOARD_LED_GREEN2_GPIO GPIOD /*!<@brief GPIO device name: GPIOD */
#define BOARD_LED_GREEN2_PORT PORTD /*!<@brief PORT device name: PORTD */
#define BOARD_LED_GREEN2_PIN 2U     /*!<@brief PORTD pin index: 2 */
                                    /* @} */

/*! @name PORTD3 (number 96), J500[A37]/J501[32]/GPIOD3/PWM_B1/LED3
  @{ */
#define BOARD_LED_YELLOW2_GPIO GPIOD /*!<@brief GPIO device name: GPIOD */
#define BOARD_LED_YELLOW2_PORT PORTD /*!<@brief PORT device name: PORTD */
#define BOARD_LED_YELLOW2_PIN 3U     /*!<@brief PORTD pin index: 3 */
                                     /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitLEDsPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
